Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ༄༅༅། །འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབུམ་པ་དང་། ཉི་ཁྲི་ལྔ་སྟོང་པ་དང་། ཁྲི་བརྒྱད་སྟོང་པའི་རྒྱ་ཆེར་བཤད་པ། བམ་པོ་དང་པོ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ།
en: The Long Explanation of the Noble Perfection of Wisdom in One Hundred Thousand, Twenty-Five Thousand, and Eighteen Thousand Lines Introduction We prostrate to Mañjuśrī Kumārabhūta.

source: །ཤེས་རབ་བདག་ཉིད་ཕ་རོལ་ཕྱིན་པའི་གཙོ། །རྒྱལ་བའི་ཡུམ་ལ་གུས་པར་ཕྱག་འཚལ་ཏེ། །བླ་མའི་ལུང་གིས་བདག་ལ་ཕན་པའི་ཕྱིར།
en: Introduction common to all sūtras Having reverently bowed to the Mother of Victors, The foremost perfection in the form of wisdom, I want to make a Path where the Thorns Have Been Trodden Down Because the tradition of the gurus has been of benefit to me.

source: །འདི་ཡི་གཞུང་འགྲེལ་གནོད་འཇོམས་བྱ་བར་འདོད།
en: Thus did I hear and so on.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་གཟུགས་ཀྱི་སྐུ་དང་། དམ་པའི་ཆོས་ཀྱི་ཚོགས་སྲུང་བར་གཏོགས་པའི་ཕྱིར་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འཁོར་གྱི་ནང་དུ་དྲིས་པ་དང་། འདི་སྐད་བདག་གིས་ཐོས་པ་ཞེས་བྱ་བས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཤད་པ་འདི་སྐད་བདག་གིས་ཐོས་པ་ཡིན་པར་འཕགས་པ་བྱམས་པ་ལ་ཁས་འཆེས་སོ།
en: Because he has been charged with protecting the form body and the true collection of teachings, the great noble bodhisattva Vajrapāṇi, asked in the assembly, says to noble Maitreya that this is the explanation of the perfection of wisdom that he has heard, with “Thus did I hear.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་བཤད་དོ་ཞེས་ཅིའི་ཕྱིར་མ་བརྗོད་ཅེ་ན།
en: Why does he not say, “Thus has the Lord said”?

source: བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་པ་རྔོམ་བརྗིད་འདི་རང་གི་ཡུལ་མ་ཡིན་པའི་ཕྱིར་ཏེ། འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ནས་འདུས་པའི་འདུལ་བའི་རིགས་དང་། བསམ་པ་དང་། སྤྱོད་པ་དང་། མོས་པ་དང་། དབང་པོ་ཐ་དད་པ་རྣམས་ལ་སྐད་ཅིག་གཅིག་ལ་ཡང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། ཞི་བ་དང་། མི་སྐྱེ་བ་དང་། མི་འགག་པ་དང་། གཟོད་མ་ནས་ཞི་བ་དང་། རང་བཞིན་གྱིས་མྱ་ངན་ལས་འདས་པ་ལ་སོགས་པའི་བྱེ་བྲག་དང་། ཕུང་པོ་དང་། ཁམས་དང་སྐྱེ་མཆེད་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། འཕགས་པའི་བདེན་པ་ལ་སོགས་པའི་བྱེ་བྲག་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: It is because the Lord’s tremendous teaching is not within his own range.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་ལ་སོགས་པའི་བྱེ་བྲག་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་སོགས་པའི་བྱེ་བྲག་གིས་སྐད་སྣ་ཚོགས་དང་། སྒོ་སྣ་ཚོགས་དང་། སྒྲ་སྣ་ཚོགས་དང་། ཆོ་འཕྲུལ་སྣ་ཚོགས་དང་།
en: The Lord teaches with a single knowledge and in a single instant, simultaneously explaining to trainees of various statuses, intentions, behaviors, beliefs, and faculties, brought together from various world systems, the particulars of the impermanent, suffering, empty, selfless, unproduced, and unceasing, in a state of primordial calm, and naturally in nirvāṇa and so on; the particulars of aggregates, constituents, sense fields, dependent originations, and noble truths and so on; the particulars of the applications of mindfulness, right efforts, legs of miraculous power, and faculties and so on; and the particulars of the ten powers, four fearlessnesses, and eighteen distinct attributes of a buddha and so on—in various languages, and with various headings, various words, various miraculous powers, various appearances, and various attainments of results.

source: འཇུག་པ་སྣ་ཚོགས་དང་། འབྲས་བུ་ཐོབ་པ་སྣ་ཚོགས་ཀྱིས་སྐད་ཅིག་དེ་ཉིད་ལ་བཤད་པ་མཁྱེན་པ་གཅིག་གིས་སྟོན་པ་སྟེ། ཇི་སྐད་དུ་ཞི་བའི་བློ་གྲོས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན། སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པའི་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱིས་མཁྱེན་པའི་སེམས་ཅན་གྱི་ཁམས་ནི་ཆེས་མང་གི། སའི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ་ཞེས་བྱ་སྟེ། ཞི་བའི་བློ་གྲོས་ཡོངས་སུ་བརྟགས་པ་ཉེ་བར་བཟུང་ན་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། ཞི་བའི་བློ་གྲོས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་འདི་ལྟ་སྟེ། གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུའི་ཤེས་རབ་དང་།
en: As it says: Śāntamati, the earth element is not as big as the amount of beings known by a buddha’s knowledge, beings in infinite, innumerable world systems in the ten directions all gathered together—a huge amount.

source: ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ལ། ཤ་ར་དྭ་ཏིའི་བུའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་ཤེས་རབ་དང་ཡེ་ཤེས་གང་ཡིན་པའི་ཤེས་རབ་དང་། ཡེ་ཤེས་དེ་སེམས་ཅན་གཅིག་དང་ལྡན་པར་གྱུར་ཅིང་རྣམ་གྲངས་འདིས་སེམས་ཅན་ཐམས་ཅད། ཤེས་རབ་དང་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ལ། ཞི་བའི་བློ་གྲོས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་བསྐལ་པའམ་བསྐལ་པ་ལས་ལྷག་པར་ཐེ་ཚོམ་གྱི་དྲི་བ་བསམས་ཤིང་གཞལ་ཏེ་ཡོངས་སུ་བཙལ་ལ་སེམས་ཅན་གཅིག་གི་ཐེ་ཚོམ་གྱི་དྲི་བ་གང་ཡིན་པ་དེ་ནི་གཉིས་པའི་མ་ཡིན་ཞིང་།
en: Śāntamati, if all those beings were to gain a human form all at once, and all those beings were to become endowed with the wisdom and knowledge of the elder Śāriputra, and all that Śāriputra-like wisdom and knowledge of all those beings were to be in a single being—if all beings were to become endowed with the wisdom and knowledge as in that analogy, and if, Śāntamati, all those beings were to entertain, judge, and ferret out questions and doubts for an eon, or more than an eon, and all the doubts one person had were not to be the doubts of a second, and, Śāntamati, were they, having in mind all the different doubts of all the beings as in that analogy, to go before the Lord and voice in a finger snap those doubts and questions, the Lord would, with one thought, become mindful of them all, and grasping all the doubts would, by uttering one statement, remove all the doubts and questions.

source: ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཐེ་ཚོམ་གྱི་དྲི་བ་ཐ་དད་པ་བསམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་གན་དུ་དོང་ནས་སེ་གོལ་གཏོགས་པ་སྲིད་ལ། ཐེ་ཚོམ་གྱི་དྲི་བ་དེ་དག་གསོལ་ཀྱང་། དེས་སེམས་གཅིག་གི་རྗེས་སུ་ཞུགས་པའི་དྲན་པས་ཐམས་ཅད་བཟུང་ནས་གསུང་རྣམ་པ་གཅིག་གིས་དེ་དག་གི་ཐེ་ཚོམ་གྱི་དྲི་བ་ཐམས་ཅད་གཅོད་དོ། །དེ་དག་ཐམས་ཅད་ཀྱང་རང་རང་གི་ཐེ་ཚོམ་གྱི་དྲི་བ་ཆད་པར་ཤེས་ཤིང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཞུས་པ་ལུང་བསྟན་པས་ཐམས་ཅད་ཀྱང་སེམས་རངས་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལྟ་བུའོ།
en: They would all know their own different doubts and questions, and they would all be overjoyed at the Lord’s answers to all their questions.

source: །དེ་བཞིན་གཤེགས་པས་གདུལ་བྱ་རྣམས་ལ་བསྟན་པའི་རིམ་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་མ་ཡིན་ནོ། །སྤྱོད་ཡུལ་དུ་གང་གྱུར་པ་དེ་ཡང་ཡང་དག་པར་སྡུད་པར་བྱེད་པ་རྣམས་ཀྱི་ཡན་ལག་གི་རིམ་པས་སྟོན་མི་ནུས་སོ།
en: Given that such a sequence of teachings to trainees by a tathāgata is not totally within the range of bodhisattvas, those who recite the Dharma are not able, with their branch sequence, to teach the full range.

source: །དེ་བས་ན་ཆོས་ཡང་དག་པར་སྡུད་པར་བྱེད་པ་རྣམས་ཀྱི་བདག་གི་སྤྱོད་ཡུལ་དུ་གྱུར་པ་གང་ཡང་རུང་བའི་ཆོས་བཤད་པའི་སྒོ་བཟུང་ནས། འདི་སྐད་བདག་གིས་ཐོས་པ་ཞེས་བྱ་བ་བདག་གི་རྣ་བས་ཐོས་པའི་ལམ་ནས་འོངས་པའི་རིམ་པ་བསྟན་ཏེ།
en: So those who recite the Dharma expound whatever Dharma is within their range, and based on that say “thus did I hear” to reveal the sequence that came into their hearing, concluding the discourse with “the Lord said this.”

source: བཤད་པའི་ཐ་མར་ཡང་འདི་བཀའ་སྩལ་ཏོ་ཞེས་མཇུག་བརྟུལ་གྱི་དེ་སྐད་བཀའ་སྩལ་ཏོ་ཞེས་ནི་མ་བརྗོད་དོ།
en: They do not say, “Thus has the Lord said.”

source: །དོན་དམ་པ་ནི་བརྗོད་དུ་མེད་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མིང་གི་ཚོགས་དང་། ཚིག་གི་ཚོགས་དང་། ཡི་གེའི་ཚོགས་ཀྱིས་གཞན་དག་ལ་ཆོས་མི་སྟོན་ཏོ།
en: Ultimately the perfection of wisdom is inexpressible, so the lord buddhas do not teach dharmas to others with collections of names, phrases, and speech sounds.

source: །དེ་བཞིན་གཤེགས་པ་ནི་རྣམ་པར་མི་རྟོག་པ་ལྷུན་གྱིས་གྲུབ་པ་དང་རྟག་ཏུ་མཉམ་པར་གཞག་པ་ཡིན་ཡང་འོན་ཀྱང་སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུ་དང་།
en: The tathāgatas are without thought construction, are spontaneous, are always absorbed in meditative equipoise.

source: སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་དབང་གིས་གདུལ་བྱ་རྣམས་བདག་བདག་གི་སྐད་རྣམས་ཀྱིས་ཆོས་བསྟན་པ་འབྱུང་སྙམ་དུ་དེ་ལྟ་དེ་ལྟར་ཤེས་སོ།
en: Nevertheless, one knows that through the force of earlier prayers, and based on the karma of beings, there are Dharma teachings in this way or that way given to trainees in their own languages.

source: །ཇི་སྐད་དུ་ཞི་བའི་བློ་གྲོས་གང་གི་ནུབ་མོ་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། གང་གི་ནུབ་མོ་ལེན་པ་མི་མངའ་བར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་དེའི་བར་དུ་དེ་བཞིན་གཤེགས་པས་ཐ་ན་ཡི་གེའི་འབྲུ་གཅིག་ཀྱང་མ་གསུངས་སོ། །གསུང་བར་མི་འགྱུར་རོ།
en: As it says: Śāntamati, on the night the Tathāgata fully awakens to unsurpassed, perfect, complete awakening, and up until the night he enters into nirvāṇa, he has not spoken and will not speak even a single syllable.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: And why?

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་ནི་རྟག་ཏུ་མཉམ་པར་གཞག་པ་སྟེ།
en: Because, Śāntamati, the Tathāgata is always absorbed in meditative equipoise.

source: དེ་བཞིན་གཤེགས་པ་ལ་དབུགས་དབྱུང་བའམ་རྔུབ་པ་མི་མངའོ། །རྣམ་པར་མི་རྟོག་གོ། །རྣམ་པར་མི་དཔྱོད་དོ། །རྣམ་པར་རྟོག་པ་དང་།
en: The Tathāgata does not breathe in and does not breathe out; he does not have applied thought and does not have sustained thought.

source: རྣམ་པར་དཔྱོད་པ་མེད་ན་ངག་མི་འབྱུང་སྟེ།
en: Without applied and sustained thought there is no speech.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཡང་རྣམ་པར་མི་རྟོག །རྣམ་པར་མི་དཔྱོད། རྣམ་པར་རིག་པར་མི་མཛད། རྣམ་པར་རྟོག་པར་མི་མཛད། མི་གསུང་།
en: The Tathāgata does not think discursively and does not sustain thought, does not make representations, does not make projections, and does not speak, utter, or make pronouncements, but still beings think, “The Tathāgata is speaking.”

source: མི་བརྗོད། གསུང་བར་མི་མཛད་ཀྱང་སེམས་ཅན་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་འདི་གསུང་ངོ་སྙམ་མོ། །དེ་བཞིན་གཤེགས་པ་ནི་ཤིན་ཏུ་མཉམ་པར་གཞག་པ་སྟེ། ཡི་གེ་རྣམ་པར་རིག་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རྣམ་པར་རིག་པར་མི་མཛད་ཀྱང་།
en: Again, the Tathāgata is totally absorbed in meditative equipoise and does not represent anything in verbal projections in any way, but still beings think about the spontaneous words, “The Tathāgata is teaching us the Dharma.”

source: སེམས་ཅན་ཡི་གེ་ལྷུར་ལེན་པ་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་བདག་ཅག་ལ་ཆོས་སྟོན་ནོ་སྙམ་མོ། །དེ་བཞིན་གཤེགས་པའི་གསུང་གི་སྒྲ་འབྱུང་བ་དེ་ནི་ནམ་མཁའ་ལས་འབྱུང་ན་སེམས་ཅན་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། སྒྲ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་ཞལ་གྱི་སྒོ་ནས་འབྱུང་ངོ་སྙམ་མོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལྟ་བུའོ།
en: When the sounds of the Tathāgata’s statements come from space, beings think, “This sound has come from the mouth of the Tathāgata,” and so on.

source: །ཆོས་ཀྱི་སྐུའི་དབང་གིས་འབྱུང་བས་ན་དམ་པའི་ཆོས་ལ་རིམ་གྲོ་བསྐྱེད་པའི་ཕྱིར་དེ་ལྟར་འབྱུང་བའི་བརྟན་པ་ཐ་མར་མཇུག་བསྡུ་བར།
en: It originates from the dharma body. Therefore, in conclusion, when it comes in that way to a definite end, it says “that is what [the Lord] said” as an act of reverence for the good Dharma.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཞེས་བསྟན་ཏོ། །དུས་གཅིག་ན་ཞེས་བྱ་བ་ནི་གང་ཡང་རུང་བའི་དུས་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: At one time means “at one time, whenever that might be.”

source: །ཅིའི་ཕྱིར་དུས་ངེས་པ་མ་མཛད་ཅེ་ན།
en: Why does it not say an exact time?

source: དགོས་པ་མེད་པའི་ཕྱིར་ཏེ།
en: Because there is no need to do so.

source: དེ་ལ་ཉི་མ་འདི་ལ། ཚེས་གྲངས་འདི་ལ། ཟླ་བ་འདི་ལ། དུས་འདི་ལ་ཞེས་བྱ་བའི་ཚིག་ནི་གང་དུ་ཡང་དགོས་པ་མེད་དེ། མི་དགོས་པ་ནི་བཤད་པར་མི་རིགས་སོ།
en: About this, there is no need at all to say words to the effect that it was on this day, on this date, in this month, at this time; and if it is unnecessary it is not right to say it.

source: །མཆོད་རྟེན་གྱི་གནས་བསྟན་པ་ནི། སེམས་ཅན་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཚོགས་སྤེལ་བར་བྱ་བ་དང་། རྩོད་པ་མེད་པའི་ཕྱིར་གནས་བསྟན་པ་ནི་རིགས་སོ།
en: As for revealing the place, which is a place of worship, it is right to reveal the place in order that beings will increase their merit accumulation by being able to go there, and because there are no disputes about it.

source: །ཡང་ན་རྩོད་པ་མེད་པར་བྱ་བའི་ཕྱིར་ཏེ།
en: Alternatively, it is so there will be no disputes.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ཉིད་ཀྱི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་དང་། གནས་སྣ་ཚོགས་སུ་གདུལ་བྱ་ཐ་དད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སམ། གཞན་དག་ལ་ཡང་བཤད་པ་སྣ་ཚོགས་ཀྱིས་བསྟན་པར་སྣང་བའི་ཕྱིར་ཏེ།
en: Thus, the Tathāgata, appearing in various forms, during just the time span of a single instant, discourses on Dharma in various world systems, in various places, to a variety of trainees—bodhisattvas or others.

source: གལ་ཏེ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་འདུས་པར་གྱུར་ན་བྱང་ཆུབ་སེམས་དཔའ་འམ་གཞན་དག་ཀྱང་རུང་སྟེ། འདི་སྐད་དུ་དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་ནི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཡུལ་འདི་ཞེས་བྱ་བ་ན་བདག་ཅག་གི་དེ་ན་བཞུགས་སོ། །བདག་ཅག་གི་དེ་ན་བཞུགས་སོ། །ཞེས་བ་རྩོད་པ་འམ་ཡིད་གཉིས་སུ་འགྱུར་ཏེ། དེ་ལྟ་བུར་འགྱུར་གྱིས་དོགས་པའི་ཕྱིར་ཐམས་ཅད་དུ་ཡང་དག་པར་སྡུད་པར་བྱེད་པ་རྣམས་ཀྱིས་དུས་ངེས་པ་མ་མཛད་དོ།
en: But given that the wanderers to be trained—bodhisattvas or others—are all gathered as one, if you say “at that time the Tathāgata in world system X, in region X…,” this could lead to arguments or uncertainty that “he was in our place Y,” or “he was in our place Z.” Since they were worried about that happening, those who recite the Dharma did not state an exact time.

source: །ཡང་ན་རྒྱལ་པོའི་ཁབ་ཏུ་ལན་མང་དུ་བཞུགས་པའི་ཕྱིར་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་པའི་དུས་གཅིག་ཅིག་ན་ཞེས་བཤད་པར་བཞེད་ནས། གཅིག་ན་ཞེས་བྱ་བའི་ཚིག་སྨོས་པར་སྦྱར་རོ།
en: Alternatively, taking it as saying one time when he was in Rājagṛha, given that he was in Rājagṛha many times, construe it as saying “one time.”

source: །བཅོམ་ལྡན་འདས་ཞེས་བྱ་བ་ནི་བདུད་བཞི་བཅོམ་པ་དང་ལྡན་པའམ།
en: The Lord (bhagavat) is one who has destroyed (bhagnavat) the four Māras.

source: ཡང་ན་འདི་ལ་ལེགས་པ་མངའ་བས་ན་བཅོམ་ལྡན་འདས་ཞེས་བྱ་སྟེ། ལེགས་པ་ཞེས་བྱ་བ་ནི་དབང་ཕྱུག་དང་།
en: Or [he is a blessed one] who “has” (vat) an “endowment” (bhaga).

source: ཡེ་ཤེས་དང་། གྲགས་པ་དང་། དཔལ་དང་། བསོད་ནམས་དང་། བརྩོན་འགྲུས་རྣམས་ལ་བྱའོ།
en: Take the endowment as these six: sovereignty, wisdom, fame, glory, merit, and perseverance.

source: །དེ་དག་ཐམས་ཅད་ཀྱང་དོན་དམ་པར་ན་དེ་བཞིན་གཤེགས་པ་ཉིད་ལ་མངའ་བས་ན། བཅོམ་ལྡན་འདས་ཞེས་བྱའོ།
en: Insofar as only a tathāgata ultimately has them all, that one is called “the Lord” or “Blessed One.”

source: །རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཞེས་བྱ་བ་ནི་བཞུགས་པ་རྣམ་པ་བཞི་སྟེ། སྤྱོད་ལམ་གྱིས་བཞུགས་པ་དང་། འཆད་པས་བཞུགས་པ་དང་། སྙོམས་པར་འཇུག་པས་བཞུགས་པ་དང་། ནང་དུ་ཡང་དག་འཇོག་གིས་བཞུགས་པའོ།
en: Dwelt at Rājagṛha— there are four dwellings: the dwellings of behavior, teaching, absorption, and retreat.

source: །སྐུའི་ཕྲིན་ལས་སུ་བགྲང་བ་གང་ཅི་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ནི་སྤྱོད་ལམ་གྱིས་བཞུགས་པའོ།
en: Any work, whatever it is, counted as physical is all the dwelling of the Lord’s behavior.

source: །གསུང་གི་ཕྲིན་ལས་གང་ཡིན་པ་དེ་དག་ནི་འཆད་པས་བཞུགས་པའོ།
en: Any verbal work is the dwelling of the Lord’s teaching.

source: །ཐུགས་ཀྱི་ཕྲིན་ལས་གང་ཡིན་པ་དེ་ནི་དེ་དག་ལས་གཞན་པའི་བཞུགས་པ་གཉིས་ཏེ། རྟག་ཏུ་མཉམ་པར་གཞག་པའི་ཕྱིར་ཏེ་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་བཞི་སྙོམས་པར་འཇུག་པས་བཞུགས་པའོ། །ཐུགས་རྗེ་ཆེན་པོས་འཇིག་རྟེན་ལ་གཟིགས་པ་དང་། ལྷ་ལ་སོགས་པ་འོང་བ་ནི་ནང་དུ་ཡང་དག་འཇོག་གིས་བཞུགས་པའོ།
en: And any mental work is the other two dwellings: he is always absorbed in meditative equipoise because of being fully absorbed in the meditative stabilizations and the four absorptions, and he is in retreat when he views the world with great compassion, and when the gods and so on arrive.

source: །རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་ཞེས་བྱ་བ་ནི།
en: He dwelt at Rājagṛha on Gṛdhrakūṭa Hill.

source: ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བའི་ཕྱོགས་གཉིས་བསྡུ་བའི་ཕྱིར་དང་། གཟུགས་ཀྱི་སྐུ་དང་། ཆོས་ཀྱི་ཚོགས་ཀྱིས་ཕན་འདོགས་པར་བསྟན་པའི་ཕྱིར་གནས་གཉིས་སྨོས་སོ།
en: It says two places because both the lay and religious wings were gathered there, or to teach that the form body and the collection of teachings assist the teaching.

source: །ཞམ་འབྲིང་བ་ཕུན་སུམ་ཚོགས་པར་བསྟན་པའི་ཕྱིར། །དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཅེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: To demonstrate that the retainers are complete, it says with a great community of monks, and so on.

source: ཞམ་འབྲིང་བ་དགེ་སློང་དང་། ཞམ་འབྲིང་བ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སོགས་པའོ།
en: The retainers are the monks and the bodhisattvas and so on.

source: །གཉི་ག་ཡང་ཤིན་ཏུ་སྦྱིན་གནས་སུ་གྱུར་པ་ཡིན་མོད་ཀྱི་འཇིག་རྟེན་ན་ཀུན་གྱིས་བཀུར་བའི་ཕྱིར་དང་། མི་འབྲལ་བའི་ཕྱིར་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཐུན་མོང་ཡིན་པའི་ཕྱིར་དང་པོར་ཞམ་འབྲིང་བ་དགེ་སློང་སྨོས་སོ།
en: Both are indeed very worthy of donations, but it announces the monks first because they are honored in the world, because the Lord does not separate from them, and because they are common to all the world.

source: །དེ་ལ་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཞེས་ནི་སྔར་ནི་སྤྱིར་སྨོས་ལ།
en: It makes the prior general statement, “a great community of monks.”

source: ཕྱིས་དགེ་སློང་ལྔ་སྟོང་ཙམ་དང་ཞེས་བྱ་བ་བྱེ་བྲག་སྨོས་ཏེ། སྤྱི་དང་བྱེ་བྲག་གིས་བསྟན་པ་བྱས་ན་ཤིན་ཏུ་འབྲེལ་བར་འགྱུར་རོ། །ཞམ་འབྲིང་བའི་མང་བ་ཉིད་བསྟན་ནས། ཆེ་བ་ཉིད་བསྟན་པར་བྱ་བའི་ཕྱིར། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ།
en: After that it specifies numbering five thousand monks, because there is a good connection when you teach the general and then the specific.

source: ཟག་པ་ཟད་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་འོག་མ་རྣམས་སྨོས་སོ།
en: Having taught that he had many retainers, to teach their greatness it says about their perfect qualities that they were all worthy ones… with outflows dried up, and so on.

source: །ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཞེས་བྱ་བས་ནི་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཁོ་ན་ཤ་སྟག་སྟེ། དེ་ན་སློབ་པ་དང་། སོ་སོའི་སྐྱེ་བོ་དག་མེད་པར་བསྟན་པ་ཡིན་ནོ། །དགྲ་བཅོམ་པ་ཞེས་བྱ་བ་ནི་དགྲ་རྣམས་བཅོམ་པ་འམ།
en: It says all of them were worthy ones since they were all “worthy ones,” that is to say, it is teaching that there were no trainees or ordinary persons.

source: འཁོར་བར་ཕྱིར་མི་སྐྱེ་བའི་ཆོས་ཉིད་དམ། རང་གི་དོན་མཐའ་དག་ཡོངས་སུ་རྫོགས་པའམ་གཞན་དག་ལ་རྗེས་སུ་སྟོན་པར་བྱེད་པར་འོས་ཏེ་ནུས་པའམ། དགེ་འདུན་དཀོན་མཆོག་ཅེས་བྱ་བར་འོས་པའམ། ཁམས་གསུམ་གྱི་གཙོ་བོ་རྣམས་ཀྱིས་རྣམ་པ་དུ་མས་མཆོད་པར་འོས་པའམ། རྒྱུན་མི་ཆད་པར་དེ་བཞིན་གཤེགས་པ་ལ་སྒྲུབ་པའི་མཆོད་པས་མཆོད་ཅིང་རྗེད་པས་ན་དགྲ་བཅོམ་པ་ཤ་སྟག་གོ།
en: They are “worthy ones” because they have destroyed [from han, “to destroy”] the foe (ari); or [from rah, “to leave”: arahat, “one who has left”] because they will not take rebirth in saṃsāra; or they have completed their own purpose (svārtha); or because they are worthy [from arh, “to be worthy”] or capable of being a teacher for others, worthy of being in the Saṅgha Jewel, worthy of many kinds of worship by those foremost in the three realms, and because they uninterruptedly worship and reverence the Tathāgata by offering their practice.

source: །ཟག་པ་ཟད་པ་ཞེས་བྱ་བ་ནི་ཆོས་བཞིས་མི་དགེ་བའི་རྩ་བ་རྣམས་ཟག་པར་བྱེད་པའམ། ཉོན་མོངས་པ་མི་གཙང་བ་ཟག་པར་བྱེད་པས་ན་ཟག་པ་ཞེས་བྱ་སྟེ།
en: Hence, they were all worthy ones. With outflows dried up— they are “outflows” because as four phenomena they seep onto the unwholesome roots or soak you with filthy afflictions.

source: གཟུགས་ལ་སོགས་པ་ཡུལ་ལྔ་དང་། སྲིད་པ་གསུམ་དང་། ལྷན་ཅིག་སྐྱེས་པ་དང་ཀུན་བརྟགས་པའི་མ་རིག་པ་དང་། ལྟ་བའི་རྣམ་པ་དྲུག་ཅུ་རྩ་གཉིས་པོ་དེ་དག་ནི་འདོད་པའི་ཟག་པ་དང་། སྲིད་པའི་ཟག་པ་དང་།
en: The four are the five objects, form and so on, that are sense object outflows; the three causes of existence that are outflows that cause existence; innate and acquired ignorance that are ignorance outflows; and the sixty-two wrong views that are view outflows.

source: མ་རིག་པའི་ཟག་པ་དང་། ལྟ་བའི་ཟག་པ་ཞེས་བྱའོ། །མི་སློབ་པའི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོས་ནི་འདོད་པའི་ཟག་པ་ཟད་དོ། །མི་སློབ་པའི་ཤེས་རབ་ཀྱི་ཕུང་པོས་ནི་ལྟ་བའི་ཟག་པ་ཟད་དོ།
en: Sense object outflows are dried up by the aggregates of nontrainee morality and meditative stabilization; view outflows are dried up by the aggregate of nontrainee wisdom.

source: །མི་སློབ་པའི་རྣམ་པར་གྲོལ་བའི་ཕུང་པོས་ནི་སྲིད་པའི་ཟག་པ་ཟད་དོ།
en: The aggregate of nontrainee liberation dries up outflows that cause existence.

source: །མི་སློབ་པའི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོས་ནི་མ་རིག་པའི་ཟག་པ་ཟད་དོ།
en: The aggregate of nontrainee knowledge and seeing of liberation dries up ignorance outflows.

source: །ཡང་ན་ཚུལ་ཁྲིམས་ཡོངས་སུ་རྫོགས་པའི་ས་མཐོང་བའི་ལམ་ན་ཡང་དག་པའི་ལྟ་བས་ནི་ལྟ་བའི་ཟག་པ་ཟད་དོ། །ཏིང་ངེ་འཛིན་ཡོངས་སུ་རྫོགས་པའི་ས་ཕྱིར་མི་འོང་བའི་ལམ་ན་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་འདོད་པའི་ཟག་པ་ཟད་དོ། །ཤེས་རབ་ཡོངས་སུ་རྫོགས་པའི་ས་དགྲ་བཅོམ་པའི་ལམ་ན་ཡང་དག་པའི་ཤེས་པ་རྣམ་པར་གྲོལ་བས་ནི་མ་རིག་པའི་ཟག་པ་ཟད་དོ། །རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་རྫོགས་པའི་སར་ཟད་པ་དང་མི་སྐྱེ་བ་ཤེས་པ་གཉིས་ཀྱིས་ནི་སྲིད་པའི་ཟག་པ་ཟད་དོ།
en: Alternatively, right view at the path of seeing level, when morality is complete, dries up view outflows; right meditative stabilization at the non-returner path level, when meditative stabilization is complete, dries up sense object outflows; right knowledge and liberation at the worthy one path level, when wisdom is complete, dry up ignorance outflows; and knowledge that they are extinct and will not arise again at the level when liberation is complete dries up outflows that cause existence.

source: །ཡང་ན་དགྲ་བཅོམ་པའི་ལམ་ན་འདོད་པའི་རྒྱུ་ཡོངས་སུ་ཤེས་པས་འདོད་པའི་ཟག་པ་ཟད་དོ། །མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཞེས་འབྱུང་བས་ན་འདུ་བྱེད་ཀྱི་རྒྱུ་ཡོངས་སུ་ཤེས་པས་མ་རིག་པའི་ཟག་པ་ཟད་དོ། །ཉོན་མོངས་པའི་རྒྱུ་ཡོངས་སུ་ཤེས་པས་ལྟ་བའི་ཟག་པ་ཟད་དོ།
en: Another alternative is that on the worthy one path, sense object outflows dry up because of comprehending the cause of desire for sense objects; ignorance outflows dry up because of comprehending the cause of volitional factors, because it is said “ignorance is the condition for volitional factors”; view outflows dry up because of comprehending the cause of afflictions; and outflows that cause existence dry up because of comprehending the causes of the aggregates.

source: །ཕུང་པོའི་རྒྱུ་ཡོངས་སུ་ཤེས་པས་སྲིད་པའི་ཟག་པ་ཟད་དོ། །ཡང་ན་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་དམིགས་པ་ལས་ལྟ་བ་ཐམས་ཅད་འབྱུང་བས་སྡུག་བསྔལ་གྱི་བདེན་པ་ཡོངས་སུ་ཤེས་པས་ལྟ་བའི་ཟག་པ་ཟད་དོ། །ཀུན་འབྱུང་བའི་བདེན་པ་སྤངས་པས་འདོད་པའི་ཟག་པ་ཟད་དོ། །འགོག་པ་མངོན་སུམ་དུ་བྱས་པས་སྲིད་པའི་ཟག་པ་ཟད་དོ། །ལམ་གྱི་བདེན་པ་བསྒོམས་པས་མ་རིག་པའི་ཟག་པ་ཟད་དོ།
en: Another alternative is that comprehending the truth of suffering dries up view outflows because all views arise with the five aggregates for appropriation as the objective support; the elimination of the truth of origination dries up sense object outflows; realization of the truth of cessation dries up outflows that cause existence; and the development of the true path dries up ignorance outflows.

source: །འདོད་པའི་ཟག་པ་སྤངས་པས་ལྷའི་བུའི་བདུད་ཆོམས་སོ། །སྲིད་པའི་ཟག་པ་སྤངས་པས་འཆི་བའི་བདུད་ཆོམས་སོ། །མ་རིག་པའི་ཟག་པ་སྤངས་པས་ཉོན་མོངས་པའི་བདུད་ཆོམས་སོ། །ལྟ་བའི་ཟག་པ་སྤངས་པས་ཕུང་པོའི་བདུད་ཆོམས་སོ།
en: Eliminating sense object outflows vanquishes Māra as a god; eliminating outflows that cause existence vanquishes Māra as death; eliminating ignorance outflows vanquishes Māra as afflictions; and eliminating view outflows vanquishes Māra as aggregates.

source: །བདུད་བཞི་ལས་རྒྱལ་བ་ལས་ཟག་པ་ཟད་པ་ཞེས་བྱའོ།
en: They have conquered the four Māras, so their “outflows are dried up.”

source: །ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Without afflictions means without defilement.

source: །ཉོན་མོངས་པར་བྱེད་པས་ཉོན་མོངས་པ་སྟེ། ལས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའོ། །འདིས་ཉོན་མོངས་པར་བྱེད་པས་ན་ཉོན་མོངས་པའི་ཀུན་ནས་ཉོན་མོངས་པའོ། །ཉོན་མོངས་པར་འགྱུར་བས་ཉོན་མོངས་པ་སྟེ་རྣམ་པར་སྨིན་པའི་ཕུང་པོའི་ཀུན་ནས་ཉོན་མོངས་པའོ། །རྒྱུ་འདི་ལས་ཉོན་མོངས་པར་འགྱུར་བས་སྐྱེ་བའི་ཀུན་ནས་ཉོན་མོངས་པའོ། །དེ་ལ་མ་རིག་པ་འགགས་པས་འདུ་བྱེད་རྣམས་འགག་གོ་ཞེས་བྱ་བས་ནི་ལས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ།
en: The defilement of action is an affliction because it causes affliction; the defilement of afflictive emotion is because it afflicts; the defilement of aggregates that have come about from karmic maturation is an affliction in the sense of the afflictions to come; and the defilement of birth is because with that as a cause the afflictions come about.
